;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Wed Mar 12 10:08:21 2025                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_errata_fpu1_workaround=on --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m_data.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("E:\GiaotrinhDH\DATN\SIMULINK\mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw\CCS_Project\Debug")
	.global	_mcb_pmsm_foc_qep_dyno_f2_ConstB
	.sect	".econst:_mcb_pmsm_foc_qep_dyno_f2_ConstB"
	.clink
	.align	2
	.elfsym	_mcb_pmsm_foc_qep_dyno_f2_ConstB,SYM_SIZE(92)
_mcb_pmsm_foc_qep_dyno_f2_ConstB:
	.xfloat	$strtod("0x1.d9e48ap-18")		; _mcb_pmsm_foc_qep_dyno_f2_ConstB._IndexVector @ 0
	.xfloat	$strtod("0x0p+0")		; _mcb_pmsm_foc_qep_dyno_f2_ConstB._IndexVector1 @ 32
	.xfloat	$strtod("0x1.61ea58p-19")		; _mcb_pmsm_foc_qep_dyno_f2_ConstB._IndexVector2 @ 64

	.xfloat	$strtod("0x1.d44764p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[947] @ 30304
	.xfloat	$strtod("0x1.d5e3fp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[948] @ 30336
	.xfloat	$strtod("0x1.d7791p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[949] @ 30368
	.xfloat	$strtod("0x1.d906bcp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[950] @ 30400
	.xfloat	$strtod("0x1.da8cf2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[951] @ 30432
	.xfloat	$strtod("0x1.dc0baap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[952] @ 30464
	.xfloat	$strtod("0x1.dd82dcp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[953] @ 30496
	.xfloat	$strtod("0x1.def286p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[954] @ 30528
	.xfloat	$strtod("0x1.e05a9ep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[955] @ 30560
	.xfloat	$strtod("0x1.e1bb2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[956] @ 30592
	.xfloat	$strtod("0x1.e31406p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[957] @ 30624
	.xfloat	$strtod("0x1.e4654cp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[958] @ 30656
	.xfloat	$strtod("0x1.e5aeecp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[959] @ 30688
	.xfloat	$strtod("0x1.e6f0e2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[960] @ 30720
	.xfloat	$strtod("0x1.e82b26p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[961] @ 30752
	.xfloat	$strtod("0x1.e95db4p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[962] @ 30784
	.xfloat	$strtod("0x1.ea8888p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[963] @ 30816
	.xfloat	$strtod("0x1.ebab9ep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[964] @ 30848
	.xfloat	$strtod("0x1.ecc6eep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[965] @ 30880
	.xfloat	$strtod("0x1.edda78p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[966] @ 30912
	.xfloat	$strtod("0x1.eee636p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[967] @ 30944
	.xfloat	$strtod("0x1.efea22p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[968] @ 30976
	.xfloat	$strtod("0x1.f0e63ap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[969] @ 31008
	.xfloat	$strtod("0x1.f1da78p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[970] @ 31040
	.xfloat	$strtod("0x1.f2c6dap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[971] @ 31072
	.xfloat	$strtod("0x1.f3ab5cp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[972] @ 31104
	.xfloat	$strtod("0x1.f487fap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[973] @ 31136
	.xfloat	$strtod("0x1.f55cb2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[974] @ 31168
	.xfloat	$strtod("0x1.f6297cp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[975] @ 31200
	.xfloat	$strtod("0x1.f6ee5ap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[976] @ 31232
	.xfloat	$strtod("0x1.f7ab48p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[977] @ 31264
	.xfloat	$strtod("0x1.f8604p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[978] @ 31296
	.xfloat	$strtod("0x1.f90d42p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[979] @ 31328
	.xfloat	$strtod("0x1.f9b24ap-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[980] @ 31360
	.xfloat	$strtod("0x1.fa4f54p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[981] @ 31392
	.xfloat	$strtod("0x1.fae462p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[982] @ 31424
	.xfloat	$strtod("0x1.fb716ep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[983] @ 31456
	.xfloat	$strtod("0x1.fbf676p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[984] @ 31488
	.xfloat	$strtod("0x1.fc7378p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[985] @ 31520
	.xfloat	$strtod("0x1.fce874p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[986] @ 31552
	.xfloat	$strtod("0x1.fd5566p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[987] @ 31584
	.xfloat	$strtod("0x1.fdba4cp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[988] @ 31616
	.xfloat	$strtod("0x1.fe1726p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[989] @ 31648
	.xfloat	$strtod("0x1.fe6bf2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[990] @ 31680
	.xfloat	$strtod("0x1.feb8bp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[991] @ 31712
	.xfloat	$strtod("0x1.fefd5cp-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[992] @ 31744
	.xfloat	$strtod("0x1.ff39f6p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[993] @ 31776
	.xfloat	$strtod("0x1.ff6e7ep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[994] @ 31808
	.xfloat	$strtod("0x1.ff9af2p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[995] @ 31840
	.xfloat	$strtod("0x1.ffbf52p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[996] @ 31872
	.xfloat	$strtod("0x1.ffdb9ep-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[997] @ 31904
	.xfloat	$strtod("0x1.ffefd4p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[998] @ 31936
	.xfloat	$strtod("0x1.fffbf6p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[999] @ 31968
	.xfloat	$strtod("0x1p+0")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[1000] @ 32000
	.xfloat	$strtod("0x1.fffbf6p-1")		; _mcb_pmsm_foc_qep_dyno_f2_ConstP._pooled29[1001] @ 32032

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("mcb_pmsm_foc_qep_dyno_f2_ConstP")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_mcb_pmsm_foc_qep_dyno_f2_ConstP")
	.dwattr $C$DW$2, DW_AT_location[DW_OP_addr _mcb_pmsm_foc_qep_dyno_f2_ConstP]
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$2, DW_AT_external

;	D:\TiC2000_Install\CCS\ccs\tools\compiler\ti-cgt-c2000_22.6.0.LTS\bin\ac2000.exe -@C:\\Users\\21145\\AppData\\Local\\Temp\\{78F6E6AA-B6B1-4D45-8DF5-4F749ED31D34} 

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x5c)
$C$DW$3	.dwtag  DW_TAG_member
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$3, DW_AT_name("IndexVector")
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("_IndexVector")
	.dwattr $C$DW$3, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$3, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$4	.dwtag  DW_TAG_member
	.dwattr $C$DW$4, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$4, DW_AT_name("IndexVector1")
	.dwattr $C$DW$4, DW_AT_TI_symbol_name("_IndexVector1")
	.dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$5	.dwtag  DW_TAG_member
	.dwattr $C$DW$5, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$5, DW_AT_name("IndexVector2")
	.dwattr $C$DW$5, DW_AT_TI_symbol_name("_IndexVector2")
	.dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$6	.dwtag  DW_TAG_member
	.dwattr $C$DW$6, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$6, DW_AT_name("IndexVector_g")
	.dwattr $C$DW$6, DW_AT_TI_symbol_name("_IndexVector_g")
	.dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$7	.dwtag  DW_TAG_member
	.dwattr $C$DW$7, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$7, DW_AT_name("IndexVector1_c")
	.dwattr $C$DW$7, DW_AT_TI_symbol_name("_IndexVector1_c")
	.dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$8	.dwtag  DW_TAG_member
	.dwattr $C$DW$8, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$8, DW_AT_name("Add")
	.dwattr $C$DW$8, DW_AT_TI_symbol_name("_Add")
	.dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$9	.dwtag  DW_TAG_member
	.dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$9, DW_AT_name("IndexVector_gf")
	.dwattr $C$DW$9, DW_AT_TI_symbol_name("_IndexVector_gf")
	.dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$10	.dwtag  DW_TAG_member
	.dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$10, DW_AT_name("IndexVector_gt")
	.dwattr $C$DW$10, DW_AT_TI_symbol_name("_IndexVector_gt")
	.dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$11	.dwtag  DW_TAG_member
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$11, DW_AT_name("IndexVector_n")
	.dwattr $C$DW$11, DW_AT_TI_symbol_name("_IndexVector_n")
	.dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$12	.dwtag  DW_TAG_member
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$12, DW_AT_name("IndexVector2_m")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("_IndexVector2_m")
	.dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$13, DW_AT_name("IndexVector_l")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("_IndexVector_l")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$14, DW_AT_name("IndexVector_i")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("_IndexVector_i")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$15, DW_AT_name("IndexVector_c")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("_IndexVector_c")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$16, DW_AT_name("IndexVector_li")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("_IndexVector_li")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$17, DW_AT_name("IndexVector1_m")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("_IndexVector1_m")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$18, DW_AT_name("IndexVector_d")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_IndexVector_d")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$19, DW_AT_name("IndexVector_p")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_IndexVector_p")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$20, DW_AT_name("IndexVector_h")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("_IndexVector_h")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$21, DW_AT_name("IndexVector1_cq")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("_IndexVector1_cq")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$22, DW_AT_name("Add_h")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("_Add_h")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$23	.dwtag  DW_TAG_member
	.dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$23, DW_AT_name("IndexVector_io")
	.dwattr $C$DW$23, DW_AT_TI_symbol_name("_IndexVector_io")
	.dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$24, DW_AT_name("IndexVector_e")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_IndexVector_e")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$25, DW_AT_name("IndexVector_ei")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_IndexVector_ei")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$26, DW_AT_name("IndexVector1_o")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_IndexVector1_o")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$27, DW_AT_name("IndexVector_ii")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("_IndexVector_ii")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$28, DW_AT_name("IndexVector_ng")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("_IndexVector_ng")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$29, DW_AT_name("IndexVector_b")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("_IndexVector_b")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$30, DW_AT_name("IndexVector_ck")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("_IndexVector_ck")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$31, DW_AT_name("IndexVector1_k")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("_IndexVector1_k")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$32, DW_AT_name("IndexVector_ds")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("_IndexVector_ds")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$33, DW_AT_name("IndexVector_f")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("_IndexVector_f")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$34, DW_AT_name("Ld_Port")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("_Ld_Port")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$35, DW_AT_name("Switch")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$36	.dwtag  DW_TAG_member
	.dwattr $C$DW$36, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$36, DW_AT_name("Lq_Port")
	.dwattr $C$DW$36, DW_AT_TI_symbol_name("_Lq_Port")
	.dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$37	.dwtag  DW_TAG_member
	.dwattr $C$DW$37, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$37, DW_AT_name("Switch1")
	.dwattr $C$DW$37, DW_AT_TI_symbol_name("_Switch1")
	.dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$38	.dwtag  DW_TAG_member
	.dwattr $C$DW$38, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$38, DW_AT_name("FluxPM_Port")
	.dwattr $C$DW$38, DW_AT_TI_symbol_name("_FluxPM_Port")
	.dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$39	.dwtag  DW_TAG_member
	.dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$39, DW_AT_name("Switch2")
	.dwattr $C$DW$39, DW_AT_TI_symbol_name("_Switch2")
	.dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$40, DW_AT_name("Ld_Lq")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("_Ld_Lq")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$41, DW_AT_name("Ld_Port_f")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("_Ld_Port_f")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$42	.dwtag  DW_TAG_member
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$42, DW_AT_name("Switch_c")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("_Switch_c")
	.dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$43	.dwtag  DW_TAG_member
	.dwattr $C$DW$43, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$43, DW_AT_name("Lq_Port_h")
	.dwattr $C$DW$43, DW_AT_TI_symbol_name("_Lq_Port_h")
	.dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$44	.dwtag  DW_TAG_member
	.dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$44, DW_AT_name("Switch1_i")
	.dwattr $C$DW$44, DW_AT_TI_symbol_name("_Switch1_i")
	.dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$45	.dwtag  DW_TAG_member
	.dwattr $C$DW$45, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$45, DW_AT_name("FluxPM_Port_d")
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("_FluxPM_Port_d")
	.dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$46	.dwtag  DW_TAG_member
	.dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$46, DW_AT_name("Switch2_j")
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("_Switch2_j")
	.dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$47	.dwtag  DW_TAG_member
	.dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$47, DW_AT_name("Ld_Lq_a")
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("_Ld_Lq_a")
	.dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$48, DW_AT_name("Width")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("_Width")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$28	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$28, DW_AT_name("ConstBlockIO_mcb_pmsm_foc_qep_d")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)

$C$DW$49	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$28)

$C$DW$T$29	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$49)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x7d4)
$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$50, DW_AT_name("pooled29")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("_pooled29")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$27

$C$DW$T$30	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$30, DW_AT_name("ConstParam_mcb_pmsm_foc_qep_dyn")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)

$C$DW$51	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$30)

$C$DW$T$31	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$51)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

$C$DW$T$23	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$23, DW_AT_name("uint16_T")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)

$C$DW$52	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$52, DW_AT_type(*$C$DW$T$23)

$C$DW$T$24	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$52)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)

$C$DW$T$21	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$21, DW_AT_name("real32_T")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)


$C$DW$T$26	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x7d4)
$C$DW$53	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$53, DW_AT_upper_bound(0x3e9)

	.dwendtag $C$DW$T$26

$C$DW$54	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)

$C$DW$T$22	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$54)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)

