;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.0.LTS *
;* Date/Time created: Wed Mar 12 10:08:20 2025                 *
;***************************************************************
	.compiler_opts --abi=coffabi --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --silicon_errata_fpu1_workaround=on --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.0.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("E:\GiaotrinhDH\DATN\SIMULINK\mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw\CCS_Project\Debug")
;**************************************************************
;* CINIT RECORDS                                              *
;**************************************************************
	.sect	".cinit"
	.align	1
	.field  	-1,16
	.field  	_MW_adcInitFlag+0,32
	.bits		0,16
			; _MW_adcInitFlag @ 0


$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("config_QEP_eQEP1")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_config_QEP_eQEP1")
	.dwattr $C$DW$1, DW_AT_declaration

	.dwattr $C$DW$486, DW_AT_TI_begin_file("E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c")
	.dwattr $C$DW$486, DW_AT_TI_begin_line(0x1c20)
	.dwattr $C$DW$486, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$486, DW_AT_TI_max_frame_size(-2)
	.dwpsn	file "E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c",line 7201,column 1,is_stmt,address _mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts,isa 0

	.dwfde $C$DW$CIE, _mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts
;----------------------------------------------------------------------
; 7200 | void mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts (void)       
;----------------------------------------------------------------------

;***************************************************************
;* FNAME: _mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts FR SIZE:   0           *
;*                                                             *
;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  0 Auto,  0 SOE     *
;***************************************************************

_mcb_pmsm_foc_qep_dyno_f28069m_unconfigure_interrupts:
	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
	.dwpsn	file "E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c",line 7202,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 7202 | HWI_TIC28x_DisableIRQ(32);                                             
;----------------------------------------------------------------------
        MOVB      AL,#32                ; [CPU_ALU] |7202| 
$C$DW$487	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$487, DW_AT_low_pc(0x00)
	.dwattr $C$DW$487, DW_AT_name("_HWI_TIC28x_DisableIRQ")
	.dwattr $C$DW$487, DW_AT_TI_call

        LCR       #_HWI_TIC28x_DisableIRQ ; [CPU_ALU] |7202| 
        ; call occurs [#_HWI_TIC28x_DisableIRQ] ; [] |7202| 
	.dwpsn	file "E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c",line 7203,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 7203 | HWI_TIC28x_DisableIRQ(33);                                             
;----------------------------------------------------------------------
        MOVB      AL,#33                ; [CPU_ALU] |7203| 
$C$DW$488	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$488, DW_AT_low_pc(0x00)
	.dwattr $C$DW$488, DW_AT_name("_HWI_TIC28x_DisableIRQ")
	.dwattr $C$DW$488, DW_AT_TI_call

        LCR       #_HWI_TIC28x_DisableIRQ ; [CPU_ALU] |7203| 
        ; call occurs [#_HWI_TIC28x_DisableIRQ] ; [] |7203| 
	.dwpsn	file "E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c",line 7204,column 3,is_stmt,isa 0
;----------------------------------------------------------------------
; 7204 | HWI_TIC28x_DisableIRQ(96);                                             
;----------------------------------------------------------------------
        MOVB      AL,#96                ; [CPU_ALU] |7204| 
$C$DW$489	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$489, DW_AT_low_pc(0x00)
	.dwattr $C$DW$489, DW_AT_name("_HWI_TIC28x_DisableIRQ")
	.dwattr $C$DW$489, DW_AT_TI_call

        LCR       #_HWI_TIC28x_DisableIRQ ; [CPU_ALU] |7204| 
        ; call occurs [#_HWI_TIC28x_DisableIRQ] ; [] |7204| 
	.dwpsn	file "E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c",line 7205,column 1,is_stmt,isa 0
$C$DW$490	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$490, DW_AT_low_pc(0x00)
	.dwattr $C$DW$490, DW_AT_TI_return

        LRETR     ; [CPU_ALU] 
        ; return occurs ; [] 
	.dwattr $C$DW$486, DW_AT_TI_end_file("E:/GiaotrinhDH/DATN/SIMULINK/mcb_pmsm_foc_qep_dyno_f28069m_ert_rtw/mcb_pmsm_foc_qep_dyno_f28069m.c")
	.dwattr $C$DW$486, DW_AT_TI_end_line(0x1c25)
	.dwattr $C$DW$486, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$486

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_config_QEP_eQEP1
	.global	_InitAdc
	.global	_config_ADC_SOC0_SOC1
	.global	_config_ADC_SOC2_SOC3
	.global	_config_QEP_eQEP2
	.global	_MW_SPI_Close
	.global	_rt_InitInfAndNaN
	.global	_config_ADC_SOC4_SOC5
	.global	_config_ADC_SOC6_SOC7
	.global	_HWI_TIC28x_ConfigureIRQ
	.global	_HWI_TIC28x_EnableIRQ
	.global	_HWI_TIC28x_AcknowledgeIrq
	.global	_HWI_TIC28x_DisableIRQ
	.global	_checkSCITransmitInProgressA
	.global	_runModel
	.global	_rtIsNaNF
	.global	_scia_xmit
	.global	_MW_SPI_SetFormat
	.global	_MW_SPI_SetSlaveSelect
	.global	_MW_SPI_MasterWriteRead_8bits
	.global	_rtIsNaN
	.global	_scia_rcv
	.global	_rtNaN
	.global	_sqrt
	.global	_floor
	.global	_MW_SPI_Open
	.global	_sin
	.global	_cos
	.global	_memset
	.global	_CpuTimer2Regs
	.global	_AdcResult
	.global	_SciaRegs
	.global	_PieCtrlRegs
	.global	_GpioDataRegs
	.global	_EQep1Regs
	.global	_EQep2Regs
	.global	_EPwm1Regs
	.global	_EPwm2Regs
	.global	_EPwm3Regs
	.global	_EPwm4Regs
	.global	_EPwm5Regs
	.global	_EPwm6Regs
	.global	_GpioCtrlRegs
	.global	_AdcRegs
	.global	_mcb_pmsm_foc_qep_dyno_f2_ConstB
	.global	_mcb_pmsm_foc_qep_dyno_f2_ConstP
	.global	FS$$DIV
	.global	_memcpy

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$491, DW_AT_name("a_plus_2b")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_a_plus_2b")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$492, DW_AT_name("one_by_sqrt3")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_one_by_sqrt3")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$493, DW_AT_name("algDD_o1")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_algDD_o1")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$494, DW_AT_name("algDD_o2")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_algDD_o2")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$20

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("rtB_TwophaseCRLwrap_mcb_pmsm_fo")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)

$C$DW$T$286	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$286, DW_AT_address_class(0x20)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x1e)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$495, DW_AT_name("Switch")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$496, DW_AT_name("Switch2")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_Switch2")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$497, DW_AT_name("Product")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_Product")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$498, DW_AT_name("Sum")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_Sum")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$499, DW_AT_name("Product2")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_Product2")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$500, DW_AT_name("Merge")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_Merge")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$501, DW_AT_name("Gain")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$502, DW_AT_name("Switch_f")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_Switch_f")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$503, DW_AT_name("Switch1")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_Switch1")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$504, DW_AT_name("Sqrt")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_Sqrt")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$505, DW_AT_name("Gain_j")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_Gain_j")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$506, DW_AT_name("DataTypeConversion")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_DataTypeConversion")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$507, DW_AT_name("Compare")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_Compare")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$508, DW_AT_name("Compare_f")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_Compare_f")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$509, DW_AT_name("LowerRelop1")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_LowerRelop1")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$510, DW_AT_name("RelationalOperator")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_RelationalOperator")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$511, DW_AT_name("UpperRelop")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_UpperRelop")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$24

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("rtB_DQAxisPriority_mcb_pmsm_foc")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)

$C$DW$T$287	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$287, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$287, DW_AT_address_class(0x20)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$512, DW_AT_name("Product")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_Product")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$513, DW_AT_name("SquareRoot")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_SquareRoot")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$514, DW_AT_name("Switch")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$515, DW_AT_name("Reciprocal")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_Reciprocal")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$516, DW_AT_name("DataTypeConversion")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_DataTypeConversion")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$517, DW_AT_name("RelationalOperator")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_RelationalOperator")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$25

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("rtB_DQEquivalence_mcb_pmsm_foc_")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)

$C$DW$T$288	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$288, DW_AT_address_class(0x20)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$518, DW_AT_name("qcos")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_qcos")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$519, DW_AT_name("dsin")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_dsin")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$520, DW_AT_name("sum_beta")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_sum_beta")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$521, DW_AT_name("dcos")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_dcos")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$522, DW_AT_name("qsin")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_qsin")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$523, DW_AT_name("sum_alpha")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_sum_alpha")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$524, DW_AT_name("Switch")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$525, DW_AT_name("algDD_o1")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_algDD_o1")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$526, DW_AT_name("algDD_o2")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_algDD_o2")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$26

$C$DW$T$71	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$71, DW_AT_name("rtB_TwoinputsCRL_mcb_pmsm_foc_q")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)

$C$DW$T$289	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$289, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$289, DW_AT_address_class(0x20)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x14)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$527, DW_AT_name("acos_n")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_acos_n")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$528, DW_AT_name("bsin")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_bsin")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$529, DW_AT_name("sum_Ds")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_sum_Ds")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$530, DW_AT_name("bcos")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_bcos")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$531, DW_AT_name("asin_p")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_asin_p")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$532, DW_AT_name("sum_Qs")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_sum_Qs")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$533, DW_AT_name("Switch")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$534, DW_AT_name("algDD_o1")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_algDD_o1")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$535, DW_AT_name("algDD_o2")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_algDD_o2")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$27

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("rtB_TwoinputsCRL_mcb_pmsm_foc_o")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)

$C$DW$T$290	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$290, DW_AT_address_class(0x20)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$536, DW_AT_name("Convert_back")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_Convert_back")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$537, DW_AT_name("Convert_uint16")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_Convert_uint16")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$29

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("rtB_IfActionSubsystem_mcb_pmsm_")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)

$C$DW$T$291	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$291, DW_AT_address_class(0x20)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$538, DW_AT_name("Convert_back")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_Convert_back")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$539, DW_AT_name("Convert_uint16")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_Convert_uint16")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$30

$C$DW$T$68	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$68, DW_AT_name("rtB_IfActionSubsystem1_mcb_pmsm")
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)

$C$DW$T$292	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$292, DW_AT_address_class(0x20)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$540, DW_AT_name("Delay3")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_Delay3")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$541, DW_AT_name("Compare")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_Compare")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$542, DW_AT_name("Compare_k")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_Compare_k")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$543, DW_AT_name("AND")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_AND")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$31

$C$DW$T$67	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$67, DW_AT_name("rtB_IndexFinder_mcb_pmsm_foc_qe")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)

$C$DW$T$293	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$293, DW_AT_address_class(0x20)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$544, DW_AT_name("Delay3_DSTATE")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_Delay3_DSTATE")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$32

$C$DW$T$86	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$86, DW_AT_name("rtDW_IndexFinder_mcb_pmsm_foc_q")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)

$C$DW$T$294	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$294, DW_AT_address_class(0x20)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$545, DW_AT_name("Sum3")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_Sum3")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$546, DW_AT_name("Sum7")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_Sum7")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$33

$C$DW$T$66	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$66, DW_AT_name("rtB_PositionNoReset_mcb_pmsm_fo")
	.dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)

$C$DW$T$295	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$295, DW_AT_address_class(0x20)


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$547, DW_AT_name("Memory")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_Memory")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$548, DW_AT_name("Sum")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_Sum")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$549, DW_AT_name("Memory1")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_Memory1")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$550, DW_AT_name("Sum1")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_Sum1")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$34

$C$DW$T$65	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$65, DW_AT_name("rtB_IfActionSubsystem_mcb_pm_hu")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)

$C$DW$T$296	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$296, DW_AT_address_class(0x20)


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$551, DW_AT_name("Memory_PreviousInput")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_Memory_PreviousInput")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$552, DW_AT_name("Memory1_PreviousInput")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_Memory1_PreviousInput")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$35

$C$DW$T$85	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$85, DW_AT_name("rtDW_IfActionSubsystem_mcb_pm_a")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)

$C$DW$T$297	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$297, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$297, DW_AT_address_class(0x20)


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x0a)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$553, DW_AT_name("obj")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_obj")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$554, DW_AT_name("objisempty")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_objisempty")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$37

$C$DW$T$84	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$84, DW_AT_name("rtDW_SPIMasterTransfer_mcb_pmsm")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)

$C$DW$T$298	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$298, DW_AT_address_class(0x20)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$555, DW_AT_name("SPIMasterTransfer")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_SPIMasterTransfer")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$38

$C$DW$T$64	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$64, DW_AT_name("rtB_SPIMasterTransfer_mcb_pmsm_")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)

$C$DW$T$299	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$299, DW_AT_address_class(0x20)


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x0a)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$556, DW_AT_name("obj")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_obj")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$557, DW_AT_name("objisempty")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_objisempty")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$39

$C$DW$T$83	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$83, DW_AT_name("rtDW_SPIMasterTransfer2_mcb_pms")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)

$C$DW$T$300	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$300, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$300, DW_AT_address_class(0x20)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$558, DW_AT_name("SPIMasterTransfer2")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_SPIMasterTransfer2")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$40

$C$DW$T$63	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$63, DW_AT_name("rtB_SPIMasterTransfer2_mcb_pmsm")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)

$C$DW$T$301	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$301, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$301, DW_AT_address_class(0x20)


$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$559, DW_AT_name("Product")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_Product")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$560, DW_AT_name("UnitDelay")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_UnitDelay")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$561, DW_AT_name("Product1")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_Product1")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$562, DW_AT_name("Add1")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_Add1")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$41

$C$DW$T$62	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$62, DW_AT_name("rtB_SpeedLimitformotor2_mcb_pms")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)

$C$DW$T$302	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$302, DW_AT_address_class(0x20)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$563, DW_AT_name("UnitDelay_DSTATE")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_UnitDelay_DSTATE")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$42

$C$DW$T$82	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$82, DW_AT_name("rtDW_SpeedLimitformotor2_mcb_pm")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)

$C$DW$T$303	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$303, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$303, DW_AT_address_class(0x20)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x5c)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$564, DW_AT_name("IndexVector")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_IndexVector")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$565, DW_AT_name("IndexVector1")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_IndexVector1")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$566, DW_AT_name("IndexVector2")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_IndexVector2")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$567, DW_AT_name("IndexVector_g")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_IndexVector_g")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$568, DW_AT_name("IndexVector1_c")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_IndexVector1_c")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$569, DW_AT_name("Add")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_Add")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$570, DW_AT_name("IndexVector_gf")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_IndexVector_gf")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$571, DW_AT_name("IndexVector_gt")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_IndexVector_gt")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$572, DW_AT_name("IndexVector_n")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_IndexVector_n")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$573, DW_AT_name("IndexVector2_m")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_IndexVector2_m")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$574, DW_AT_name("IndexVector_l")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_IndexVector_l")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$575, DW_AT_name("IndexVector_i")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_IndexVector_i")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$576, DW_AT_name("IndexVector_c")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_IndexVector_c")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$577, DW_AT_name("IndexVector_li")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_IndexVector_li")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$578, DW_AT_name("IndexVector1_m")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_IndexVector1_m")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$579, DW_AT_name("IndexVector_d")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_IndexVector_d")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$580, DW_AT_name("IndexVector_p")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_IndexVector_p")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$581, DW_AT_name("IndexVector_h")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_IndexVector_h")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$582, DW_AT_name("IndexVector1_cq")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_IndexVector1_cq")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$583, DW_AT_name("Add_h")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_Add_h")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$584, DW_AT_name("IndexVector_io")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_IndexVector_io")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$585, DW_AT_name("IndexVector_e")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_IndexVector_e")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$586, DW_AT_name("IndexVector_ei")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_IndexVector_ei")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$587, DW_AT_name("IndexVector1_o")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_IndexVector1_o")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$588, DW_AT_name("IndexVector_ii")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_IndexVector_ii")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$589, DW_AT_name("IndexVector_ng")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_IndexVector_ng")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$590, DW_AT_name("IndexVector_b")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_IndexVector_b")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$591, DW_AT_name("IndexVector_ck")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_IndexVector_ck")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$592, DW_AT_name("IndexVector1_k")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_IndexVector1_k")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$593, DW_AT_name("IndexVector_ds")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_IndexVector_ds")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$594, DW_AT_name("IndexVector_f")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_IndexVector_f")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$595, DW_AT_name("Ld_Port")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_Ld_Port")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$596, DW_AT_name("Switch")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$597, DW_AT_name("Lq_Port")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_Lq_Port")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$598, DW_AT_name("Switch1")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_Switch1")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$599, DW_AT_name("FluxPM_Port")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_FluxPM_Port")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$600, DW_AT_name("Switch2")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_Switch2")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$601, DW_AT_name("Ld_Lq")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_Ld_Lq")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$602, DW_AT_name("Ld_Port_f")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_Ld_Port_f")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$603, DW_AT_name("Switch_c")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_Switch_c")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$604, DW_AT_name("Lq_Port_h")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_Lq_Port_h")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$605, DW_AT_name("Switch1_i")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_Switch1_i")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$606, DW_AT_name("FluxPM_Port_d")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_FluxPM_Port_d")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$607, DW_AT_name("Switch2_j")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_Switch2_j")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$608, DW_AT_name("Ld_Lq_a")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_Ld_Lq_a")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$609, DW_AT_name("Width")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_Width")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$47

$C$DW$T$304	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$304, DW_AT_name("ConstBlockIO_mcb_pmsm_foc_qep_d")
	.dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$304, DW_AT_language(DW_LANG_C)

$C$DW$610	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$304)

$C$DW$T$305	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$305, DW_AT_type(*$C$DW$610)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x7d4)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$611, DW_AT_name("pooled29")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_pooled29")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)

	.dwendtag $C$DW$T$49

$C$DW$T$306	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$306, DW_AT_name("ConstParam_mcb_pmsm_foc_qep_dyn")
	.dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$306, DW_AT_language(DW_LANG_C)

$C$DW$612	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$306)

$C$DW$T$307	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$307, DW_AT_type(*$C$DW$612)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x522)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$613, DW_AT_name("DiscreteTimeIntegrator")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_DiscreteTimeIntegrator")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$614, DW_AT_name("Gain")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_Gain")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$615, DW_AT_name("DiscreteTimeIntegrator3")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_DiscreteTimeIntegrator3")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$616, DW_AT_name("UnitDelay")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_UnitDelay")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$617, DW_AT_name("Switch1")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_Switch1")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$618, DW_AT_name("Gain4")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_Gain4")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$619, DW_AT_name("sine_cosine_o1")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_sine_cosine_o1")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$620, DW_AT_name("sine_cosine_o2")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_sine_cosine_o2")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$621, DW_AT_name("Product2")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_Product2")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$622, DW_AT_name("DiscreteTimeIntegrator3_c")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_DiscreteTimeIntegrator3_c")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$623, DW_AT_name("Product3")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_Product3")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$624, DW_AT_name("Add1")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_Add1")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$625, DW_AT_name("DiscreteTimeIntegrator3_p")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_DiscreteTimeIntegrator3_p")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$626, DW_AT_name("DiscreteTimeIntegrator3_k")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_DiscreteTimeIntegrator3_k")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$627, DW_AT_name("Switch2")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_Switch2")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$628, DW_AT_name("Product")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("_Product")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$629, DW_AT_name("Product_j")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("_Product_j")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$630, DW_AT_name("Gain1")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("_Gain1")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$631, DW_AT_name("Add")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("_Add")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$632, DW_AT_name("Gain2")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("_Gain2")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$633, DW_AT_name("Divide2")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("_Divide2")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$634, DW_AT_name("Sign")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("_Sign")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$635, DW_AT_name("Divide1")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("_Divide1")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$636, DW_AT_name("Sum1")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("_Sum1")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$637, DW_AT_name("Divide")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("_Divide")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$638, DW_AT_name("Gain_n")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("_Gain_n")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$639, DW_AT_name("Gain1_b")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("_Gain1_b")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$640, DW_AT_name("Add_o")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("_Add_o")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$641, DW_AT_name("Gain_j")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("_Gain_j")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$642, DW_AT_name("Gain1_l")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("_Gain1_l")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$643, DW_AT_name("Gain4_h")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("_Gain4_h")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$644, DW_AT_name("Add_a")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("_Add_a")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$645, DW_AT_name("Gain2_f")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("_Gain2_f")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$646, DW_AT_name("Gain3")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("_Gain3")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$647, DW_AT_name("Add1_e")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("_Add1_e")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$648, DW_AT_name("Gain1_c")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("_Gain1_c")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$649, DW_AT_name("Gain2_m")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("_Gain2_m")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$650, DW_AT_name("Product_f")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("_Product_f")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$651, DW_AT_name("Product1")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("_Product1")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$652, DW_AT_name("Add_e")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("_Add_e")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$653, DW_AT_name("Gain3_o")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("_Gain3_o")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$654, DW_AT_name("Gain4_n")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("_Gain4_n")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$655, DW_AT_name("Product2_h")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("_Product2_h")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$656, DW_AT_name("Product3_h")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("_Product3_h")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$657, DW_AT_name("Add1_p")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("_Add1_p")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$658, DW_AT_name("Product_h")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("_Product_h")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$659, DW_AT_name("Product_l")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("_Product_l")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$660, DW_AT_name("Product_hs")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("_Product_hs")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$661, DW_AT_name("Product_m")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("_Product_m")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$662, DW_AT_name("Add_b")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("_Add_b")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$663, DW_AT_name("Product_e")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("_Product_e")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$664, DW_AT_name("Product1_o")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("_Product1_o")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$665, DW_AT_name("Add_i")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("_Add_i")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$666, DW_AT_name("Product_hv")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("_Product_hv")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$667, DW_AT_name("Product_n")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("_Product_n")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$668, DW_AT_name("Product_d")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("_Product_d")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$669, DW_AT_name("Product_jr")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("_Product_jr")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$670, DW_AT_name("Product_g")
	.dwattr $C$DW$670, DW_AT_TI_symbol_name("_Product_g")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$671, DW_AT_name("Add_l")
	.dwattr $C$DW$671, DW_AT_TI_symbol_name("_Add_l")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$672, DW_AT_name("VectorConcatenate")
	.dwattr $C$DW$672, DW_AT_TI_symbol_name("_VectorConcatenate")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$673, DW_AT_name("UnitDelay_b")
	.dwattr $C$DW$673, DW_AT_TI_symbol_name("_UnitDelay_b")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$674, DW_AT_name("Switch1_f")
	.dwattr $C$DW$674, DW_AT_TI_symbol_name("_Switch1_f")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$675, DW_AT_name("Gain4_c")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("_Gain4_c")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$676, DW_AT_name("sine_cosine_o1_o")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("_sine_cosine_o1_o")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$677, DW_AT_name("sine_cosine_o2_d")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("_sine_cosine_o2_d")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$678, DW_AT_name("Product2_o")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("_Product2_o")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$679, DW_AT_name("Product3_o")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("_Product3_o")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$680, DW_AT_name("Add1_c")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("_Add1_c")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$681, DW_AT_name("Gain_p")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("_Gain_p")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$682, DW_AT_name("Gain1_ct")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("_Gain1_ct")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$683, DW_AT_name("Add_p")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("_Add_p")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$684, DW_AT_name("Switch1_f4")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("_Switch1_f4")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$685, DW_AT_name("Gain_p4")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("_Gain_p4")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$686, DW_AT_name("Gain1_f")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("_Gain1_f")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$687, DW_AT_name("Gain4_e")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("_Gain4_e")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$688, DW_AT_name("Add_c")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("_Add_c")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$689, DW_AT_name("Gain2_b")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("_Gain2_b")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$690, DW_AT_name("Gain3_a")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("_Gain3_a")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$691, DW_AT_name("Add1_b")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("_Add1_b")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$692, DW_AT_name("Gain1_i")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("_Gain1_i")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$693, DW_AT_name("Gain2_n")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("_Gain2_n")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$694, DW_AT_name("Product_c")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("_Product_c")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$695, DW_AT_name("Product1_a")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("_Product1_a")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$696, DW_AT_name("Add_f")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("_Add_f")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$697, DW_AT_name("Gain3_e")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("_Gain3_e")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$698, DW_AT_name("Gain4_f")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("_Gain4_f")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$699, DW_AT_name("Product2_hz")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("_Product2_hz")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$700, DW_AT_name("Product3_d")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("_Product3_d")
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$701, DW_AT_name("Add1_pe")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("_Add1_pe")
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$702	.dwtag  DW_TAG_member
	.dwattr $C$DW$702, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$702, DW_AT_name("Product_nq")
	.dwattr $C$DW$702, DW_AT_TI_symbol_name("_Product_nq")
	.dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$703	.dwtag  DW_TAG_member
	.dwattr $C$DW$703, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$703, DW_AT_name("Product_ee")
	.dwattr $C$DW$703, DW_AT_TI_symbol_name("_Product_ee")
	.dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$704, DW_AT_name("Product_b")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("_Product_b")
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$705, DW_AT_name("Product_a")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("_Product_a")
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$706, DW_AT_name("Add_ob")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("_Add_ob")
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$707, DW_AT_name("Product_o")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("_Product_o")
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$708, DW_AT_name("Product1_f")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("_Product1_f")
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$709, DW_AT_name("Add_j")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("_Add_j")
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$710, DW_AT_name("Product_jy")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("_Product_jy")
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$711, DW_AT_name("Product_cr")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("_Product_cr")
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$712, DW_AT_name("Product_p")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("_Product_p")
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$713, DW_AT_name("Product_ef")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("_Product_ef")
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$714, DW_AT_name("Product_m2")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("_Product_m2")
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$715, DW_AT_name("Add_bg")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("_Add_bg")
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$716, DW_AT_name("VectorConcatenate_p")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("_VectorConcatenate_p")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$717, DW_AT_name("Gain1_m")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("_Gain1_m")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$718, DW_AT_name("Product_d1")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("_Product_d1")
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$719, DW_AT_name("Product_fu")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("_Product_fu")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$720, DW_AT_name("Add_n")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("_Add_n")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$721, DW_AT_name("Gain2_l")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("_Gain2_l")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$722, DW_AT_name("Add1_f")
	.dwattr $C$DW$722, DW_AT_TI_symbol_name("_Add1_f")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$723, DW_AT_name("Switch")
	.dwattr $C$DW$723, DW_AT_TI_symbol_name("_Switch")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$724, DW_AT_name("Subtract")
	.dwattr $C$DW$724, DW_AT_TI_symbol_name("_Subtract")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$725, DW_AT_name("Add1_k")
	.dwattr $C$DW$725, DW_AT_TI_symbol_name("_Add1_k")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$726	.dwtag  DW_TAG_member
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$726, DW_AT_name("Switch_b")
	.dwattr $C$DW$726, DW_AT_TI_symbol_name("_Switch_b")
	.dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
	.dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$727, DW_AT_name("Subtract_b")
	.dwattr $C$DW$727, DW_AT_TI_symbol_name("_Subtract_b")
	.dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$728, DW_AT_name("PositionToCount")
	.dwattr $C$DW$728, DW_AT_TI_symbol_name("_PositionToCount")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$729, DW_AT_name("Delay")
	.dwattr $C$DW$729, DW_AT_TI_symbol_name("_Delay")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$730, DW_AT_name("Sum")
	.dwattr $C$DW$730, DW_AT_TI_symbol_name("_Sum")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$731	.dwtag  DW_TAG_member
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$731, DW_AT_name("PositionToCount_g")
	.dwattr $C$DW$731, DW_AT_TI_symbol_name("_PositionToCount_g")
	.dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
	.dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$732, DW_AT_name("Delay_h")
	.dwattr $C$DW$732, DW_AT_TI_symbol_name("_Delay_h")
	.dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$733, DW_AT_name("Sum_n")
	.dwattr $C$DW$733, DW_AT_TI_symbol_name("_Sum_n")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$734, DW_AT_name("Sum_d")
	.dwattr $C$DW$734, DW_AT_TI_symbol_name("_Sum_d")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$735, DW_AT_name("RT1")
	.dwattr $C$DW$735, DW_AT_TI_symbol_name("_RT1")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$736	.dwtag  DW_TAG_member
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$736, DW_AT_name("RT3")
	.dwattr $C$DW$736, DW_AT_TI_symbol_name("_RT3")
	.dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$737, DW_AT_name("RT9")
	.dwattr $C$DW$737, DW_AT_TI_symbol_name("_RT9")
	.dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$738, DW_AT_name("RT2")
	.dwattr $C$DW$738, DW_AT_TI_symbol_name("_RT2")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$739, DW_AT_name("mtr2_VI_debug")
	.dwattr $C$DW$739, DW_AT_TI_symbol_name("_mtr2_VI_debug")
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$740	.dwtag  DW_TAG_member
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$740, DW_AT_name("mtr2_Te_PU")
	.dwattr $C$DW$740, DW_AT_TI_symbol_name("_mtr2_Te_PU")
	.dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$741, DW_AT_name("mtr2_Pm_PU")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("_mtr2_Pm_PU")
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$742, DW_AT_name("mtr2_Speed_PU")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("_mtr2_Speed_PU")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$743, DW_AT_name("mtr2_Iab_meas_PU")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("_mtr2_Iab_meas_PU")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x12e]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$744, DW_AT_name("mtr2_Pos_PU")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("_mtr2_Pos_PU")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x132]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$745, DW_AT_name("RT7")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("_RT7")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$746, DW_AT_name("Id_ref")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("_Id_ref")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$747, DW_AT_name("Switch_bo")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("_Switch_bo")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$748, DW_AT_name("Product_dy")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("_Product_dy")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$749, DW_AT_name("UnitDelay_g")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("_UnitDelay_g")
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x13e]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$750, DW_AT_name("Product1_k")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("_Product1_k")
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$751, DW_AT_name("Add1_cl")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("_Add1_cl")
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x142]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$752, DW_AT_name("Sum_k")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("_Sum_k")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$753, DW_AT_name("PProdOut")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("_PProdOut")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x146]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$754, DW_AT_name("Ki2")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("_Ki2")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$755, DW_AT_name("Integrator")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("_Integrator")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x14a]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$756, DW_AT_name("Sum_l")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("_Sum_l")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$757, DW_AT_name("DeadZone")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("_DeadZone")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$758, DW_AT_name("IProdOut")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("_IProdOut")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$759, DW_AT_name("Switch_k")
	.dwattr $C$DW$759, DW_AT_TI_symbol_name("_Switch_k")
	.dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x152]
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$760, DW_AT_name("Saturation")
	.dwattr $C$DW$760, DW_AT_TI_symbol_name("_Saturation")
	.dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$761, DW_AT_name("DataTypeConversion1")
	.dwattr $C$DW$761, DW_AT_TI_symbol_name("_DataTypeConversion1")
	.dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x156]
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$762, DW_AT_name("DataStoreRead2")
	.dwattr $C$DW$762, DW_AT_TI_symbol_name("_DataStoreRead2")
	.dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$763, DW_AT_name("DataStoreRead1")
	.dwattr $C$DW$763, DW_AT_TI_symbol_name("_DataStoreRead1")
	.dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x15a]
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$764, DW_AT_name("DataTypeConversion1_d")
	.dwattr $C$DW$764, DW_AT_TI_symbol_name("_DataTypeConversion1_d")
	.dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$765, DW_AT_name("InvertingNoninvertingCurrentmea")
	.dwattr $C$DW$765, DW_AT_TI_symbol_name("_InvertingNoninvertingCurrentmea")
	.dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$766	.dwtag  DW_TAG_member
	.dwattr $C$DW$766, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$766, DW_AT_name("DTC")
	.dwattr $C$DW$766, DW_AT_TI_symbol_name("_DTC")
	.dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)

$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$767, DW_AT_name("Product_mt")
	.dwattr $C$DW$767, DW_AT_TI_symbol_name("_Product_mt")
	.dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x166]
